import type { TimeLinePoint } from '../types/timelineTypes';

export const timelinePoints: TimeLinePoint[] = [
    {
        id: 1,
        title: "Война",
        period: { from: "1914", to: "1918" },
        events: [
            { year: "1915", description: "Гибель лайнера RMS Lusitania — «толчок» США к вступлению в войну" },
            { year: "1916", description: "Брусиловский прорыв — крупная операция Восточного фронта" },
            { year: "1917", description: "Февральская и Октябрьская революции в России — смена режима" },
            { year: "1918", description: "Конец Первой мировой войны, распад империй" },
            { year: "1918", description: "Испанский грипп — пандемия охватывает Европу и Азию" }
        ]
    },
    {
        id: 2,
        title: "Революции",
        period: { from: "1919", to: "1925" },
        events: [
            { year: "1920", description: "Расстрел адмирала Колчака — конец Белого движения в Сибири" },
            { year: "1921", description: "Кронштадтское восстание — восстание моряков против власти" },
            { year: "1922", description: "Образование СССР — важное геополитическое изменение" },
            { year: "1923", description: "Первая перепись населения СССР" },
            { year: "1924", description: "Смерть В. Ленина — смена власти в СССР" }
        ]
    },
    {
        id: 3,
        title: "Экономика",
        period: { from: "1925", to: "1929" },
        events: [
            { year: "1925", description: "Начало индустриализации, рост экономики" },
            { year: "1926", description: "Всероссийская перепись населения — важный демографический шаг" },
            { year: "1927", description: "Строительство крупного промышленного объекта — Турксиб" },
            { year: "1928", description: "Запуск первой пятилетки в СССР — масштабный экономический план" },
            { year: "1929", description: "Начало коллективизации — социальные изменения в сельском хозяйстве" }
        ]
    },
    {
        id: 4,
        title: "Кризисы",
        period: { from: "1929", to: "1935" },
        events: [
            { year: "1929", description: "Великая депрессия — экономический кризис в мире" },
            { year: "1930", description: "Бразильская революция 1930 года — смена власти" },
            { year: "1930", description: "Падение мировых рынков — социальные последствия" },
            { year: "1931", description: "Японская агрессия — начало вторжения в Маньчжурию" },
            { year: "1932", description: "Усиление международной нестабильности — пересмотр границ и договоров" }
        ]
    },
    {
        id: 5,
        title: "Политика",
        period: { from: "1935", to: "1940" },
        events: [
            { year: "1935", description: "Экономический кризис и подъем авторитарных режимов" },
            { year: "1936", description: "Усиление репрессий и политических чисток" },
            { year: "1937", description: "Рост международной напряжённости — приближение войны" },
            { year: "1938", description: "Аншлюс, территориальные конфликты, военная мобилизация" },
            { year: "1939", description: "Начало Второй мировой войны — глобальный кризис" }
        ]
    },
    {
        id: 6,
        title: "Космос",
        period: { from: "1961", to: "1975" },
        events: [
            { year: "1961", description: "Юрий Гагарин — первый человек в космосе" },
            { year: "1969", description: "NASA: высадка людей на Луну — миссия «Аполлон-11»" },
            { year: "1971", description: "Запуск первой орбитальной станции — «Салют-1»" },
            { year: "1973", description: "Запуск американской станции «Скайлэб»" },
            { year: "1975", description: "Совместная космическая миссия: «Союз — Аполлон»" }
        ]
    }
];